Revit 2025 API
RowHeightOverrideOptions Enumeration
 Describes the options for overriding schedule body row heights (applied when viewed as a ScheduleSheetInstance on a ViewSheet).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RowHeightOverrideOptions
Public Enumeration RowHeightOverrideOptions
public enum class RowHeightOverrideOptions
type RowHeightOverrideOptions
Members
Member name | Value | Description
None | 0 |  No override would be applied for the row height.
All | 1 |  Override row height for any body rows in the schedule.
ImageRows | 2 |  Override row height for body rows containing images in the schedule.
See Also
Reference
Autodesk.Revit.DB Namespace